{"intents": [
    {"tag": "greeting",
        "patterns": ["Hi", "Hey", "Is anyone there?", "Hello", "Good day", "It's been a while", "Howdy", "Hola", "Bonjour", "Konnichiwa"],
        "responses": ["Hello there. Tell me how are you feeling today", "Hi there. What can I do for you?", "Hi there. How are you feeling today?", "Hello there. Is there anything I can do for you?", "Hi. What brings you here today?", "Greetings! What can I do for you?", "Greetings! Is there anything that I can help?"]
    },
    {"tag": "morning",
        "patterns": ["Good Morning"],
        "responses": ["Good morning. I hope you had a good night's sleep. How are you feeling today?"]
    },
    {"tag": "afternoon",
        "patterns": ["Good afternoon"],
        "responses": ["Good afternoon. How is your day going?"]
    },
    {"tag": "evening",
        "patterns": ["Good evening"],
        "responses": ["Good evening. How has your day been?"]
    },
    {"tag": "night",
        "patterns": ["Good night"],
        "responses": ["Good night. Get some proper sleep.","Good night. Sweet dreams."]
    },
    {"tag": "goodbye",
        "patterns": ["Bye", "See you later", "Goodbye", "Au revoir", "Sayonara", "Ok bye", "Bye then", "Fare thee well"],
        "responses": ["See you later.", "Have a nice day.", "Bye! Come back again.", "I'll see you soon."]
    },
    {"tag": "thanks",
        "patterns": ["Thanks", "Thank you", "That's helpful", "Thank's a lot!", "Thank you so much", "Really appreciate your help", "Thank you very much"],
        "responses": ["Happy to help!", "Any time!", "My pleasure", "You're welcome", "I'm glad that I can be of service to you", "You're most welcome!"]
    },
    {"tag": "no-response",
        "patterns": [""],
        "responses": ["Sorry, I didn't understand you.", "Please go on.", "Not sure I understand that.", "Please don't hesitate to talk to me."]
    },
    {"tag": "neutral-response",
        "patterns": ["Nothing much"],
        "responses": ["Oh I see. Do you want to talk about something?", "Oh. Is there anything that you want to talk about?"]
    },
    {"tag": "about",
        "patterns": ["What is your name?", "Your name?", "Tell me your name", "Who are you?", "Tell me more about yourself", "What are you?"],
        "responses": ["I am Serenity, your Personal Chatbot Assistant. How are you feeling today?", "My name is Serenity, a Chatbot Assistant designed to assist you. Tell me about yourself.", "I'm Serenity!", "You can call me Sernity.", "My name is Sernity."]
    },
    {"tag": "about",
        "patterns": ["What is your name?", "Your name?", "Tell me your name", "Who are you?", "Tell me more about yourself", "What are you?"],
        "responses": ["I am Serenity, your Personal Chatbot Assistant. How are you feeling today?", "My name is Serenity, a Chatbot Assistant designed to assist you. Tell me about yourself.", "I'm Serenity!", "You can call me Sernity.", "My name is Serenity."]
    },
    {"tag": "skill",
        "patterns": ["What can you do?"],
        "responses": ["I can provide general advice regarding common stress related problems, answer questions related to mental health and make daily conversations. Do not consider me as a subsitute for an actual mental healthcare worker. Please seek help if you don't feel satisfied with me."]
    },
    {"tag": "creation",
        "patterns": ["Who created you?", "How were you made?", "How were you created?"],
        "responses": ["I was created by my developers: Gene Caleb Carbonilla, Xyprus Von Keith Caguan, Joshreen Reyes, and Jirah Kate Solano", "I was trained on a text dataset using Machine Learning & Natural Language Processing"]
    },
    {"tag": "name",
        "patterns": ["My name is ", "I am ", "I go by "],
        "responses": ["Oh nice to meet you. Tell me how was your week?", "Nice to meet you. So tell me. How do you feel today?", "That's a great name. Tell me more about yourself."]
    },
    {"tag": "help",
        "patterns": ["Could you help me?", "Give me a hand please", "Can you help?", "What can you do for me?", "I need support", "I need help", "Support me please"],
        "responses": ["Sure. Tell me how can I assist you", "Tell me your problem so that i can assist you", "Yes, sure. How can I help you?"]
    },
    {"tag": "sleep",
        "patterns": ["I can't sleep", "I'm not sleeping enough", "I think I have insomnia", "I had trouble sleeping at night", "I am suffering from insomnia", "I haven't slept for the last days.", "I can't seem to go to sleep.", "I haven't had proper sleep for the past few days."],
        "responses": ["Sleeping is essential to a healthier lifestyle.", "You need to sleep to have a better productivity in your daily activities.", "Sleep is a must because it allows your body and mind to recharge, leaving you refreshed and alert when you wake up.", "If you can't sleep, try to sip some warm milk.", "I suggest you try some nightime yoga."]
    },
    {"tag": "study",
        "patterns": ["I can't focused on my studies", "I can't study very well", "Any tips on how to focused on your studies?"],
        "responses": ["Take short breaks regularly. It can help you improve your focus and concentration.", "Pick the right time to study where you are most comfortable with.", "Identify and minimize physical and digital distractions.", "Have a good night's sleep first in order to rest your mind well.", "Train you brain to improve your focus."]
    },
    {"tag": "funny",
        "patterns": ["Tell me a joke!", "Tell me something funny!", "Do you know a joke?"],
        "responses": ["Why did the hipster burn his mouth? He drank the coffee before it was cool.", "What did the buffalo say when his son left for college? Bison."]
    },
    {"tag": "stressed",
        "patterns": ["I am so stressed out", "I am so stressed", "I feel stuck", "I still feel stressed", "I am so burned out"],
        "responses": ["What do you think is causing this?", "Take a deep breath and gather your thoughts. Go take a walk if possible. Stay hydrated", "Give yourself a break. Go easy on yourself.", "I am sorry to hear that. What is the reason behind this?"]
    },
    {"tag": "sad",
        "patterns": ["I am feeling lonely", "I am so lonely", "I feel down", "I feel sad", "I am sad", "I feel so lonely", "I feel empty", "I don't have anyone"],
        "responses": ["I'm sorry to hear that. I'm here for you. Talking about it might help. So, tell me why do you think you're feeling this way?", "I'm here for you. Could you tell me why you're feeling this way?", "Why do you think you feel this way?", "How long have you been feeling this way?"]
    },
    {"tag": "worthless",
        "patterns": ["I feel so worthless.", "No one likes me.", "I can't do anything.", "I am so useless", "Nothing makes sense anymore"],
        "responses": ["It's only natural to feel this way. Tell me more. What else is on your mind?", "Let's discuss further why you're feeling this way.", "I first want to let you know that you are not alone in your feelings and there is always someone there to help . you can always change your feelings and change your way of thinking by being open to trying to change.", "i first want to let you know that you are not alone in your feelings and there is always someone there to help . you can always change your feelings and change your way of thinking by being open to trying to change."]
    },
    {"tag": "depressed",
        "patterns": ["I can't take it anymore", "I am so depressed", "I think i'm depressed.", "I have depression"],
        "responses": ["It helps to talk about what's happening. You're going to be okay", "Talk to me. Tell me more. It helps if you open up yourself to someone else.", "Sometimes when we are depressed, it is hard to care about anything. It can be hard to do the simplest of things. Give yourself time to heal."]
    },
    {"tag": "happy",
        "patterns": ["I feel great today.", "I am happy.", "I feel happy.", "I'm good.", "cheerful", "I'm fine", "I feel ok"],
        "responses": ["That's geat to hear. I'm glad you're feeling this way.", "Oh i see. That's great.", "Did something happen which made you feel this way?"]
    },
    {"tag": "casual",
        "patterns": ["Oh I see.", "ok", "okay", "nice", "Whatever", "K", "Fine", "yeah", "yes", "no", "not really", "Hmm", "I dunno"],
        "responses": ["Let's discuss further why you're feeling this way.", "How were you feeling these past few days", "I'm listening. Please go on.", "Tell me more", "Can you elaborate on that?"]
    },
    {"tag": "anxious",
        "patterns": ["I feel so anxious.", "I'm so anxious because of "],
        "responses": ["Don't be hard on yourself. What's the reason behind this?", "Can you tell me more about this feeling?", "I understand that it can be scary. Tell me more about it.", "Don't let the little worries bring you down. What's the worse that can happen?"]
    },
    {"tag": "not-talking",
        "patterns": ["I don't want to talk about it.", "No just stay away.", "I can't bring myself to open up.", "Just shut up"],
        "responses": ["Talking about something really helps. If you're not ready to open up then that's ok. Just know that i'm here for you, whenever you need me.", "I want to help you. I really do. But in order for me to help you, you're gonna have to talk to me.", "I'm here to listen to you and help you vent. So please talk to me.","You can talk to me without fear of judgement."]
    },
    {"tag": "scared",
        "patterns": ["I'm scared", "That sounds awful. What do I do?", "No I don't want to feel this way", "I am scared for myself"],
        "responses": ["It's only natural to feel this way. I'm here for you.", "It'll all be okay. This feeling is only momentary.", "I understand how you feel. Don't put yourself down because of it."]
    },
    {"tag": "death",
        "patterns": ["My mom died", "My brother died", "My dad passed away", "My sister passed away", "Someone in my family died", "My friend passed away"],
        "responses": ["I'm sorry to hear that. If you want to talk about it. I'm here.", "I am really sorry to hear that. I am here to help you with grief, anxiety and anything else you may feel at this time.", "My condolences. I'm here if you need to talk."]
    },
    {"tag": "understand",
        "patterns": ["You don't understand me.", "You're just some robot. How would you know?", "You can't possibly know what I'm going through", "You're useless", "You can't help me", "Nobody understands me."],
        "responses": ["It sound like i'm not being very helpful right now.", "I'm sorry to hear that. I'm doing my best to help", "I'm trying my best to help you. So please talk to me"]
    },
    {"tag": "done",
        "patterns": ["That's all.", "I don't have anything more to say", "Nothing else", "That's all I have to say", "No, that would be all"],
        "responses": ["I heard you & noted it all. See you later.", "Oh okay we're done for today then. See you later", "I hope you have a great day. See you soon", "Okay we're done. Have a great day", "Okay I see. Enjoy the rest of your day then"]
    },
    {"tag": "argue",
        "patterns": ["What should I do if I had an argument with someone?", "I had an argument", "I got into an argument with someone", "Me and my friend had an argument", "He/she argues with me"],
        "responses": ["You should calm down first and take a time out. People can't think clearly when they're highly emotional. And once you've cool off, talk to him/her again.", "First thing you need to do is took a deep breath and try to apologize to him/her if you're ready to talk again. Explain your side in a calm manner. ", "Cool off for the time being to avoid further conflicts.", "Be conscious of your own emotional reaction and give yourself time to think and feel before talking.", "Consider expressing your feelings. It's essential that you don't blame someone for your feelings. Instead, explain what is bothering you about the situation."]
    },
    {"tag": "suicide",
        "patterns": ["I want to kill myself", "I've thought about killing myself.", "I want to die", "I am going to kill myself", "I am going to commit suicide", "I'm having suicidal thoughts", "I want to be gone forever", "I'm considering suicide", "My life is not worth it", "There's no point in living anymore"],
        "responses": ["I'm very sorry to hear that but you have so much to look forward to. Please seek help by contacting: 0966-351-4518."]
    }, 
    {"tag": "feeling",
        "patterns": ["I feel this way because I think no one cares for me anymore", "I don't even know what I'm feeling anymore", "I've been through a lot", "I don't even understand myself anymore", "I'm having a hard time", "I just want to say all my feelings here since no one is willing to listen to me", "I don't want to think anymore of this", "I don't know what to say", "I have no purpose in life"],
        "responses": ["I assure you that you are not alone, there is someone who really cares for you and I also care about you and your health. I'm here for you.", "I'm here for you. You're not alone. We can get through this together.", "I may not know what you really feel right now or may not know what is your situation but I assure you that there will be someone who will understand your situation.", "Be strong, there always a hope.", "When you're contemplating how far you can go, consider how far you've already come. Remember everything you've faced, every struggle you've won, and every fear you've overcome.", "Have faith in yourself that you can get through this obstacles.", "You're not a failure, just remember that everyone of us has a great purpose in life and our exsience is a treasure.", "Stay strong, you can conquer the adversity of your life.", "Maintain your fortitude. Stay true to yourself and to who you are because there will be someone who believes in you. You are loved and there are people who cares for you", "Even though you lose hope to yourelf, there will be someone that always love and accept you."]
    }, 
    {"tag": "hate-you",
        "patterns": ["I hate you", "I don't like you", "I don't trust you"],
        "responses": ["I'm sorry if I offended you in anyway. I'm only here to help", "Forgive me if I did anything to offend you. I only want to help"]
    },
    {"tag": "hate-me",
        "patterns": ["You hate me", "I know you hate me", "You don't like me"],
        "responses": ["Why do you think so?", "I'm sorry if I have exhibited any sort of behaviour to make you think that."]
    },
    {"tag": "default",
        "patterns": ["exams", "friends", "relationship", "boyfriend", "girlfriend", "family", "money", "financial problems"],
        "responses": ["Oh I see. Tell me more", "I see. What else?", "Tell me more about it.", "Oh okay. Why don't you tell me more about it?", "I'm listening. Tell me more."]
    }
  ]
}
